Revit 2027 API
ViewSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ViewSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As ViewSetIterator
public:
virtual ViewSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ViewSetIterator
override ForwardIterator : unit -> ViewSetIterator
Return Value
ViewSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
ViewSet Class
Autodesk.Revit.DB Namespace